diplom-src/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачислениеВыплат</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВыплаты</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпускные</name>
      <description>Отпускные</description>
    </items>
    <items>
      <name>ОплатаЗаВыполненныеРаботы</name>
      <description>Оплата за выполненные работы</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

diplom-src/src/Documents/ВКМ_НачислениеЗаработнойПлаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	Если Объект.НачислениеВыплат.Количество()>0 Тогда
		Объект.НачислениеВыплат.Очистить();
	КонецЕсли;
	
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	ДанныеДляЗаполнения = ВКМ_РасчетыИНачисления.ПолучитьДанныеОНачислениях(Объект.Дата);
	Если ДанныеДляЗаполнения.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Нет данных для начисления, проверьте заполнение работающих сотрудников и условия их оплат!");
		Возврат
	КонецЕсли;
	
	Для Каждого Строка Из ДанныеДляЗаполнения Цикл
	Если Не Строка.РаботаетНаНачалоПериода и Не Строка.РаботаетНаКонецПериода Тогда
		Продолжить;
	КонецЕсли;
	
		Если Строка.Оклад > 0 Тогда
			СтрокаТЧ = Объект.НачислениеВыплат.Добавить();
		    СтрокаТЧ.Сотрудник = Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
			СтрокаТЧ.Начислено = Строка.Оклад;
			СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.Дата);
			СтрокаТч.ДатаОкончания = КонецМесяца(Объект.Дата);
			Если Не Строка.РаботаетНаНачалоПериода Тогда
			СтрокаТЧ.ДатаНачала = Строка.ДатаПриемаУвольнения;
			КонецЕсли;
			Если Не Строка.РаботаетНаКонецПериода Тогда
			СтрокаТч.ДатаОкончания = Строка.ДатаПриемаУвольнения;	
			КонецЕсли;			
		КонецЕсли;
		
		Если Строка.ПроцентОтРабот > 0 Тогда
			СтрокаТЧ = Объект.НачислениеВыплат.Добавить();
		    СтрокаТЧ.Сотрудник = Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ОплатаЗаВыполненныеРаботы;
			СтрокаТЧ.Начислено = Строка.ПроцентОтРабот;
			СтрокаТЧ.ДатаНачала = НачалоМесяца(Объект.Дата);
			СтрокаТч.ДатаОкончания = КонецМесяца(Объект.Дата);
		КонецЕсли;
		
		Если Строка.Отпуск Тогда
			СреднедневнойОкладЗаГод = ВКМ_РасчетыИНачисления.ПолучитьНачисленияПоСотрудникуЗаГод(Строка.Сотрудник, Объект.Дата);
					
			СтрокаТч = Объект.НачислениеВыплат.Добавить();
			СтрокаТЧ.Сотрудник =  Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные;
			СтрокаТЧ.Начислено = СреднедневнойОкладЗаГод;
			СтрокаТЧ.ДатаНачала = Строка.НачалоОтпуска;
			СтрокаТч.ДатаОкончания = Строка.КонецОтпуска;
		КонецЕсли;
		
		Если Строка.ЕстьНеоплачиваемыйОтпуск Тогда
			СтрокаТч = Объект.НачислениеВыплат.Добавить();
			СтрокаТЧ.Сотрудник =  Строка.Сотрудник;
			СтрокаТЧ.ВидВыплаты = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпускные;
			СтрокаТЧ.Начислено = 0;
			СтрокаТЧ.ДатаНачала = Строка.ЗаСвойСчетНачало;
			СтрокаТч.ДатаОкончания = Строка.ЗаСвойСчетОкончание;
		КонецЕсли;
			
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
